# BuiltInFailures.SectionViewFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SectionViewFailures Class
BuiltInFailures Class Members See Also
---
Failures about Section.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SectionViewFailures
```

Visual Basic
---
```text
Public NotInheritable Class SectionViewFailures
```

Visual C++
---
```text
public ref class SectionViewFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SectionViewFailures
# See Also
BuiltInFailures..::..SectionViewFailures Members
Autodesk.Revit.DB Namespace